
import UIKit
import StorageService

let postArray = [
    ModelPost(author: "СВЕТЯЩИЕСЯ КАМНИ CORE GLOW",
              desciption: "Core Glow это необыкновенно красивые светящиеся камни, которые часто сравнивают с Млечным путем. Сейчас это один из самых популярных способов оформления земельного участка.\nСделаны они из природной гальки, из смолы с добавлением фотолюминесцентного пигмента. Достаточно всего пару часов на солнце и любая дорожка с рядом расставленными растениями станет настоящими тропиками из киношедевра «Аватар».\nВыглядит очень красиво и оригинально.",
              image: "kamni",
              likes: 476,
              views: 732),
    ModelPost(author: "ПЕС ПО КЛИЧКЕ СТАББИ ОТ БРОДЯГИ ДО ГЕРОЯ",
              desciption: "Это невероятная история о собаке, которая участвовала в Первой мировой войне и сделала настолько много подвигов, что стала первой и единственной собакой, которой присвоили за подвиги воинское звание сержанта.\nСтабби был обыкновенным бездомным щенком, которого Рядовой Джон Роберт Конрой в 1917 году подобрал неподалеку от территории Йельского университета.\nОднажды утром. Когда солдаты еще спали, началась газовая атака, учуяв газ Стабби начал бегать по траншеям, лаять, кусать спящих солдат, всеми силами пытаясь их разбудить. В то утро он спас очень много человеческих жизней.\nОднажды Стабби даже смог задержать немецкого разведчика – он укусил врага, и лая, призвал к себе солдат, которые арестовали шпиона.\nПод конец войны Стабби принял участие в в 17 боях, также параллельно поднимая боевой дух в госпитале своих раненых друзей.\nЗа все его заслуги Стабби удостоили звания сержанта. У него было много наград. Но самой великой наградой стала золотая медаль Общества гуманитарного образования США, которой он был почетно награжден в 1921 году.",
              image: "pes_stabbi",
              likes: 685,
              views: 1066),
    ModelPost(author: "ПОУЧИТЕЛЬНЫЙ ЭКСПЕРИМЕНТ СОЛОМОНА ЭША",
              desciption: "Известный психолог Соломон Эш в 1951 году провел интересный эксперимент, в котором выяснилось, насколько человек свободен в своем выборе на самом деле, несмотря на мнение большинства.\nИспытуемым людям сказали, что они пройдут несколько очень простых проверок зрения. После этого им показали картинки и каждому задали простые вопросы с очень очевидными ответами. Главной уловкой было то, что все кроме одного испытуемого были подставные, и их главным заданием было дать по сигналу психолога один и тот же ответ – «неправильный» на конкретный вопрос.\nНапример, на рисунке было три палочки, одна из которых была явно больше всех. Когда испытуемый на вопрос «какая самая длинная палочка» давал правильный ответ, все остальные говорили на среднюю палку. Главный испытуемый практически всегда ставил под сомнение свое мнение и присоединялся к большинству.\nВывод – насколько бы мы не были индивидуальны, общественное мнение имеет непосредственное влияние на наше мнение, на кого-то больше, на кого-то меньше – но, несомненно, имеет. ",
              image: "SolomonAsh",
              likes: 270,
              views: 1333),
    ModelPost(author: "ЛУЧШИЙ ЭЛЕКТРОМОБИЛЬ TESLA MODEL S SIGNATURE PERFOMANCE",
              desciption: "В обществе пока считают, что электромобиль просто не может быть удобным и быстрым. Но Tesla Model S Signature Perfomance полностью ломает любые стереотипы. Запас хода этого автомобиля 480 км, его максимальная скорость 209 км/ч. Удивляет и разгон машины за 4,4 секунды до 100 км/ч! Полностью заряжается за 5 часов от 220 В.\nНо на особых станциях машину можно зарядить и за 30 минут. Сегодня Tesla Model S - самый безопасный серийным автомобиль, который когда либо создавался человеком.\nТакже автомобиль был удостоен по всем тестам 5 звездам NCAP. Самое приятное то, что все эти плюсы при нулевом выбросе CO2.",
              image: "TeslaModelS",
              likes: 645,
              views: 1918),
]

let photoCell = ["bizon", "cow", "flamingo", "shepherd"]

let photoCollectionArray: [UIImage] = [
    UIImage(named: "bizon")!,
    UIImage(named: "cow")!,
    UIImage(named: "flamingo")!,
    UIImage(named: "shepherd")!,
    UIImage(named: "image5")!,
    UIImage(named: "image6")!,
    UIImage(named: "image7")!,
    UIImage(named: "image8")!,
    UIImage(named: "image9")!,
    UIImage(named: "image10")!,
    UIImage(named: "image11")!,
    UIImage(named: "image12")!,
    UIImage(named: "image13")!,
    UIImage(named: "image14")!,
    UIImage(named: "image15")!,
    UIImage(named: "image16")!,
    UIImage(named: "image17")!,
    UIImage(named: "image18")!,
    UIImage(named: "image19")!,
    UIImage(named: "image20")!
]
